# -*- coding:utf-8 -*-
# Author:D.Gray
import sys
data = {
    '海贼王':{
        '草帽海贼团':{
            '路飞':{'果实能力':'橡胶果实','霸气':['武装色霸气','见闻色霸气','霸王色霸气'],'男':21},
            '索罗':{'果实能力':'无','霸气':['武装色霸气','见闻色霸气'],'男':24},
            '香吉士':{'果实能力':'无','霸气':['武装色霸气','见闻色霸气'],'男':23},
        },
        '七武海':{
            '波雅汉库克':{'果实能力':'甜甜果实','霸气':['武装色霸气','见闻色霸气','霸王色霸气'],'女':20},
            '鹰眼米霍克':{'果实能力':'无','霸气':['武装色霸气','见闻色霸气'],'男':26},
            '小丑巴基':{'果实能力':'分裂果实','霸气':'无','男':25},
        },
        '四皇':{
            '香克斯':{'果实能力':'未知','霸气':['武装色霸气','见闻色霸气','霸王色霸气'],'男':28},
            '黑胡子':{'果实能力':'黑暗果实','霸气':['武装色霸气','见闻色霸气'],'男':28},
            '凯多':{'果实能力':'未知','霸气':['武装色霸气','见闻色霸气'],'男':28},
        },

    },
    '妖精的尾巴':{
        '灭龙魔导师':{
            '纳兹':{'属性能力':'火之灭龙魔法','男':21,},
            '伽吉鲁':{'属性能力':'铁之灭龙魔法','男':23,},
            '温蒂':{'属性能力':'天之灭龙魔法','女':18,},
        },
        '超S魔导师':{
            '吉尔达斯':{'属性能力':'粉碎','男':28},
            '艾璐萨':{'属性能力':'变装魔法','女':26},
            '米拉杰':{'属性能力':'变成撒旦','女':27},
        },
        '六魔将':{
            '深夜':{'属性能力':'扭曲空间','男':24},
            '克布拉':{'属性能力':'毒之灭龙魔法','男':24},
            '安吉拉':{'属性能力':'召唤星灵','女':22},
        },
    },
    '火影':{
       '木叶村':{
           '宇智波.鼬': {'属性能力':'万花筒写轮眼','男':26},
           '日向雏田': {'属性能力':'白眼','女':24},
           '我爱罗': {'属性能力':'砂纸守鹤','男':24},
       },
        '晓':{
            '佩恩':{'属性能力':'轮回眼','男':28},
            '鬼鲛':{'属性能力':['水遁','鲛肌'],'男':28},
            '迪达拉':{'属性能力':['黏土炸弹','自爆'],'男':28}
        },
        '代目':{
            '初代':{'姓名':'千手柱间','属性能力':'树诞降临','男':99999},
            '三代':{'姓名':'猿飞','属性能力':['土流大河','召唤猿魔'],'男':64},
            '四代':{'姓名':'波风水门','属性能力':['飞雷神之术','螺旋丸'],'男':34},

        },
    },
}
result_lists = []
for d1 in data:
    print(d1)
while True:
    choise = input('请选择想要的漫画>>>:')
    if choise in data:
        while True:
            for d2 in data[choise]:
                print('\t',d2)
            choise2 = input('请选择查询目录>>>:')
            if choise2 in data[choise]:
                while True:
                    for d3 in data[choise][choise2]:
                        print('\t\t',d3)
                    choise3 = input('请选择查询人物>>>:')
                    if choise3 in data[choise][choise2]:
                        result_lists.append(choise3)
                        for result in data[choise][choise2][choise3].items():
                            result_lists.append(result)
                            print(result)
                        choise4 = input('是否还要继续查询>>>:')
                        if choise4 != 'q':
                            pass
                        else:
                            print('*******查询结果********')
                            for result_list in result_lists:
                                print(result_list)
                            sys.exit('退出程序')

                    elif choise3 == '' or choise3 == ' ':
                        print('输入不能为空')
                    elif choise3 == 'b':
                        break
                    elif choise3 == 'q':
                        sys.exit('程序退出')
                    else:
                        print('请输入有效内容')

            elif choise2 == '' or choise2 == ' ':
                print('输入不能为空')
            elif choise2 == 'b':
                break
            elif choise2 == 'q':
                sys.exit('程序退出')
            else:
                print('请输入有效内容')

    elif choise == '' or choise == ' ':
        print('输入不能为空')
    elif choise == 'q':
        sys.exit('程序退出')
    else:
        print('请输入有效内容')